In [1]:
import pandas as pd

In [3]:
data = [4, 7, -5, 3]
s1 = pd.Series(data)
type(s1)

pandas.core.series.Series

In [5]:
people = {
    "name": ["John","Jane", "Joe", "Janet", "Jules"],
    "age": [23, 41, 34, 40, 55]
}
df = pd.DataFrame(people)
type(df)

pandas.core.frame.DataFrame

In [6]:
s1 = pd.Series([25, 30, 35, 40], name='age')
s2 = pd.Series(['New York', 'San Francisco', 'Los Angeles', 'Chicago'], name='city')

In [8]:
df2 = pd.concat([s1, s2], axis=1)
type(df2)

pandas.core.frame.DataFrame

In [10]:
import pandas as pd

file_path = 'data/listings.csv'
df = pd.read_csv(file_path)
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,2818,Quiet Garden View Room & Super Fast Wi-Fi,3159,Daniel,NaN,Oostelijk Havengebied - Indische Buurt,52.36435,4.94358,Private room,69,3,322,2023-02-28,1.90,1,44,37,0363 5F3A 5684 6750 D14D
1,20168,Studio with private bathroom in the centre 1,59484,Alexander,NaN,Centrum-Oost,52.36407,4.89393,Private room,106,1,339,2020-04-09,2.14,2,0,0,0363 CBB3 2C10 0C2A 1E29
2,27886,"Romantic, stylish B&B houseboat in canal district",97647,Flip,NaN,Centrum-West,52.38761,4.89188,Private room,143,3,248,2023-02-26,1.82,1,14,20,0363 974D 4986 7411 88D8
3,28871,Comfortable double room,124245,Edwin,NaN,Centrum-West,52.36775,4.89092,Private room,76,2,476,2023-02-28,3.12,2,79,97,0363 607B EA74 0BD8 2F6F
4,29051,Comfortable single room,124245,Edwin,NaN,Centrum-Oost,52.36584,4.89111,Private room,56,2,618,2023-03-03,4.23,2,69,85,0363 607B EA74 0BD8 2F6F

In [11]:
type(df)

pandas.core.frame.DataFrame

In [14]:
file_path = 'data/tf.xlsx'
df = pd.read_excel(file_path)
print(df.head())

   customerID  gender  SeniorCitizen Partner Dependents  tenure PhoneService  \
0  7590-VHVEG  Female              0     Yes         No       1           No
1  5575-GNVDE    Male              0      No         No      34          Yes
2  3668-QPYBK    Male              0      No         No       2          Yes
3  7795-CFOCW    Male              0      No         No      45           No
4  9237-HQITU  Female              0      No         No       2          Yes

      MultipleLines InternetService OnlineSecurity  ... DeviceProtection  \
0  No phone service             DSL             No  ...               No
1                No             DSL            Yes  ...              Yes
2                No             DSL            Yes  ...               No
3  No phone service             DSL            Yes  ...              Yes
4                No     Fiber optic             No  ...               No

  TechSupport StreamingTV StreamingMovies        Contract PaperlessBilling  \
0          No          No              No  Month-to-month              Yes
1          No          No              No        One year               No
2          No          No              No  Month-to-month              Yes
3         Yes          No              No        One year               No
4          No          No              No  Month-to-month              Yes

               PaymentMethod MonthlyCharges  TotalCharges Churn
0           Electronic check          29.85         29.85    No
1               Mailed check          56.95        1889.5    No
2               Mailed check          53.85        108.15   Yes
3  Bank transfer (automatic)          42.30       1840.75    No
4           Electronic check          70.70        151.65   Yes

[5 rows x 21 columns]

In [18]:
import pandas as pd

file_path = './data/athletes.json'
df = pd.read_json(file_path)
print(df)

                   Name  Age  Gender
0         Stephen Curry   33    male
1           Te'a Cooper   24  female
2          Lebron James   36    male
3       Serena Williams   39  female
4          Simone Biles   24  female
5  Giannis Antetokoumpo   26    male
6           Naomi Osaka   23  female
7            Chris Paul   36    male

In [19]:
import sqlite3

In [27]:
# Connect to the SQLite database
conn = sqlite3.connect('./data/example.db')

# Read data from the database using an SQL query
query = "SELECT * FROM employees"
df = pd.read_sql_query(query, conn)
print(df.head())

# Close the connection
conn.close()

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [23]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df.head()

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [24]:
file_path = 'data/output_data.csv'
df.to_csv(file_path, index=False)

In [25]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# Connect to the SQLite database
conn = sqlite3.connect('data/example.db')

# Write data to the database
table_name = 'employees'
df.to_sql(table_name, conn, if_exists='replace', index=False)

# Close the connection
conn.close()

In [28]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'age': [25, 30, 35, 40, 45, 50],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami', 'Boston']
}
df = pd.DataFrame(data)

# Display the first 3 rows
df.head(3)

# Display the last 2 rows
df.tail(2)

    name  age    city
4    Eva   45   Miami
5  Frank   50  Boston

In [29]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])

In [30]:
df

      name  age           city
A    Alice   25       New York
B      Bob   30  San Francisco
C  Charlie   35    Los Angeles
D    David   40        Chicago

In [32]:
print(df.loc[["A","C"]])

      name  age         city
A    Alice   25     New York
C  Charlie   35  Los Angeles

In [33]:
print(df.loc["A","city"])

New York

In [36]:
print(df.loc[:, ["name", "age"]])

      name  age
A    Alice   25
B      Bob   30
C  Charlie   35
D    David   40

In [37]:
print(df.iloc[0])

name       Alice
age           25
city    New York
Name: A, dtype: object

In [38]:
print(df.iloc[[0,2]])

      name  age         city
A    Alice   25     New York
C  Charlie   35  Los Angeles

In [39]:
print(df.iloc[0, 2])

New York

In [40]:
print(df.at["A", "city"])

New York

In [41]:

data = {
    'age': [25, 30, 35, 40],
    'income': [50000, 55000, 60000, 65000]
}
df = pd.DataFrame(data)

In [43]:
df.describe(include="all")

             age        income
count   4.000000      4.000000
mean   32.500000  57500.000000
std     6.454972   6454.972244
min    25.000000  50000.000000
25%    28.750000  53750.000000
50%    32.500000  57500.000000
75%    36.250000  61250.000000
max    40.000000  65000.000000

In [44]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

In [45]:
df

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [49]:
sorted_df = df.sort_values(by=["age","city"], ascending=False)
sorted_df

      name  age           city
3    David   40        Chicago
2  Charlie   35    Los Angeles
1      Bob   30  San Francisco
0    Alice   25       New York

In [50]:
older_30 = df[df["age"] > 30]
older_30

      name  age         city
2  Charlie   35  Los Angeles
3    David   40      Chicago

In [51]:
older_than_30 = df.query("age > 30")
older_than_30

      name  age         city
2  Charlie   35  Los Angeles
3    David   40      Chicago

In [52]:
df

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [53]:
cities = ["New York", "Chicago"]
filter_cities = df[df["city"].isin(cities)]
filter_cities

    name  age      city
0  Alice   25  New York
3  David   40   Chicago

In [54]:
data = {
    'department': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
    'employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'salary': [50000, 55000, 60000, 62000, 70000, 72000]
}
df = pd.DataFrame(data)
df

  department employee  salary
0         HR    Alice   50000
1         HR      Bob   55000
2         IT  Charlie   60000
3         IT    David   62000
4      Sales      Eva   70000
5      Sales    Frank   72000

In [56]:
group_obj = df.groupby("department")
calc_sum = group_obj["salary"].sum()
calc_sum

department
HR       105000
IT       122000
Sales    142000
Name: salary, dtype: int64

In [59]:
calc_mean = group_obj.salary.mean()

In [60]:
calc_mean

department
HR       52500.0
IT       61000.0
Sales    71000.0
Name: salary, dtype: float64